In [1]:
import numpy as np
import pandas as pd

# Reading data

In [42]:
pd.read_csv("./data/StudentsPerformance.csv", )

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# Creating DataFrames

In [43]:
df = pd.DataFrame(
    {"a" : [4, 5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])

In [44]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [66]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [67]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [68]:
my_df = df.copy()

In [69]:
my_df["a"] = my_df["a"] + 20

In [70]:
my_df

    a  b   c
1  24  7  10
2  25  8  11
3  26  9  12

In [72]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

# Reshaping data

In [73]:
pd.melt(df)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [6]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
pd.pivot(df, columns='a')

     b               c
a    4    5    6     4     5     6
1  7.0  NaN  NaN  10.0   NaN   NaN
2  NaN  8.0  NaN   NaN  11.0   NaN
3  NaN  NaN  9.0   NaN   NaN  12.0

In [95]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [80]:
df1 = pd.DataFrame(
    [[4, 7],
    [5, 8],
    [6, 9]],
    index=[1, 2, 3],
    columns=['a', 'b'])

In [81]:
df2 = pd.DataFrame(
    [[34, 37, 310],
    [35, 38, 311],
    [36, 39, 312]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [82]:
new_df = pd.concat([df1, df2])

In [83]:
new_df.reset_index()

   index   a   b      c
0      1   4   7    NaN
1      2   5   8    NaN
2      3   6   9    NaN
3      1  34  37  310.0
4      2  35  38  311.0
5      3  36  39  312.0

In [79]:
pd.concat([df1, df2], axis=1)

   a  b   c   a   b    c
1  4  7  10  34  37  310
2  5  8  11  35  38  311
3  6  9  12  36  39  312

# Sorting data

In [13]:
df.sort_values(by="a", ascending=False)

   a  b   c
3  6  9  12
2  5  8  11
1  4  7  10

# Droping columns

In [14]:
df.drop(columns=["a"])

   b   c
1  7  10
2  8  11
3  9  12

# Filtering by logic

In [89]:
df[df.b > 8]

   a  b   c
3  6  9  12

# Largest and smallest

In [16]:
df.nlargest(2, "a")

   a  b   c
3  6  9  12
2  5  8  11

In [17]:
df.nsmallest(2, "a")

   a  b   c
1  4  7  10
2  5  8  11

# Checking membership

In [90]:
df[df.a.isin([4])]

   a  b   c
1  4  7  10

# Choose rows and columns

In [19]:
df.iloc[1, 1]

8

In [20]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [92]:
df.iloc[:, 2]

1    10
2    11
3    12
Name: c, dtype: int64

In [97]:
df.loc[1, "a"]

4

In [23]:
df.loc[df.a < 6, "b"]

1    7
2    8
Name: b, dtype: int64

In [24]:
df.iat[1, 1]

8

In [25]:
df.at[1, "a"]

4

# Summarize data

In [26]:
df.value_counts("a")

a
4    1
5    1
6    1
Name: count, dtype: int64

In [27]:
df.shape

(3, 3)

In [28]:
df.a.unique()

array([4, 5, 6], dtype=int64)

In [29]:
df.a.nunique()

3

In [30]:
df.describe()

         a    b     c
count  3.0  3.0   3.0
mean   5.0  8.0  11.0
std    1.0  1.0   1.0
min    4.0  7.0  10.0
25%    4.5  7.5  10.5
50%    5.0  8.0  11.0
75%    5.5  8.5  11.5
max    6.0  9.0  12.0

In [31]:
df.a.sum()

15

# Handling missing data

In [98]:
df_nan = pd.DataFrame(
    [[np.nan, 7, 10],
    [5, None, 11],
    [pd.NaT, 9, np.nan]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [33]:
df_nan.isna()

       a      b      c
1   True  False  False
2  False   True  False
3   True  False   True

In [100]:
df_nan

     a    b     c
1  NaN  7.0  10.0
2    5  NaN  11.0
3  NaT  9.0   NaN

In [101]:
df_nan.isnull()

       a      b      c
1   True  False  False
2  False   True  False
3   True  False   True

In [35]:
df_nan.fillna("Empty")

       a      b      c
1  Empty    7.0   10.0
2      5  Empty   11.0
3  Empty    9.0  Empty

In [102]:
df_nan.dropna(how="all")

     a    b     c
1  NaN  7.0  10.0
2    5  NaN  11.0
3  NaT  9.0   NaN

# Handling duplicates

In [103]:
df_duplicates =  pd.DataFrame(
    [[7, 7, 7],
    [7, 7, 7],
    [7, 7, 7]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [38]:
df_duplicates

   a  b  c
1  7  7  7
2  7  7  7
3  7  7  7

In [39]:
df_duplicates.duplicated()

1    False
2     True
3     True
dtype: bool

In [40]:
df_duplicates.drop_duplicates()

   a  b  c
1  7  7  7